# Напишите программу, которая на входе получает 2 числа, производит с ними арифметическую операцию
# (на ваше усмотрение), и выводит “Результат = {результат}”.
num_1, num_2 = int(input()), int(input())
result = num_1 + num_2
print('Результат =', result)
print('Результат =', num_1 + num_2)
print(f'Результат = {result}')
